
{
    "appTitle": "OnStep Configurator",
    "appDescription": "Welcome! This tool helps you create a personalized configuration file for your OnStep telescope controller. Please select a firmware version to begin.",
    "classicTitle": "OnStep Classic",
    "onstepxTitle": "OnStepX",
    "classicTagline": "The stable choice for 8-bit controllers.",
    "onstepxTagline": "The modern, feature-rich firmware for 32-bit controllers.",
    "classicFeatures": "<li><b>Target Hardware:</b> 8-bit microcontrollers (e.g., Arduino Mega 2560).</li><li><b>Performance:</b> Reliable but with limited processing power.</li><li><b>Features:</b> Includes all essential functions for basic astronomical tracking and GOTO.</li><li><b>Ideal for:</b> Simpler, older hardware, or when maximum stability is the goal.</li>",
    "onstepxFeatures": "<li><b>Target Hardware:</b> 32-bit microcontrollers (e.g., ESP32, STM32).</li><li><b>Performance:</b> Significantly faster with more memory.</li><li><b>Features:</b> Advanced pointing models, WiFi, Bluetooth, web interface, and many other extra capabilities.</li><li><b>Ideal for:</b> Modern hardware, if you want the latest features and highest precision.</li>",
    "wikiButton": "Wiki / Help",
    "backToHomeButton": "‹ Back to Main Menu",
    "wizardTitleStep1": "Basic Settings",
    "wizardTitleStep2": "Motor and Gearing",
    "wizardTitleStep3": "Driver Settings",
    "wizardTitleStep4": "Summary and Generation",
    "wizardPrev": "Back",
    "wizardNext": "Next",
    "wizardSummary": "Summary",
    "summaryText": "Based on your settings, the preview of the generated <code>Config.h</code> file is shown below. If everything looks correct, you can save the file with the 'Download' button.",
    "summaryWaiting": "Generating configuration...",
    "downloadButton": "Download (Config.h)",
    "wikiTitle": "Knowledge Base",
    "wikiNavPrerequisites": "Prerequisites",
    "wikiNavHardware": "Hardware Selection",
    "wikiNavGearing": "Gearing",
    "PINMAP_LABEL": "Controller Board",
    "PINMAP_DESC": "<strong>What is this?</strong><br>The PINMAP defines which pin on the microcontroller is responsible for which function (e.g., which pin controls the 'step' signal for the RA stepper motor).<br><br><strong>Why is it important?</strong><br>Every OnStep controller board (e.g., FYSETC E4, MaxPCB3) has a different pinout. Selecting the correct PINMAP is essential, otherwise, the controller won't be able to move the motors. This setting selects the appropriate <code>Pins.xxx.h</code> file during compilation. Check your board's documentation for the correct value!",
    "MOUNT_TYPE_LABEL": "Mount Type",
    "MOUNT_TYPE_DESC": "Specify the physical construction of your telescope mount. This fundamentally affects how the controller calculates the tracking of celestial objects.<br><br><strong>German Equatorial (GEM) Types:</strong><br>- <code>GEM</code>: Standard German equatorial mount. Most equatorial mounts fall into this category. OnStep automatically handles meridian flips.<br>- <code>GEM_TA</code>, <code>GEM_TAC</code>: For GEM mounts with a tangent arm declination drive.<br><br><strong>Fork Types:</strong><br>- <code>FORK</code>: Standard equatorial fork mount. Typically used with Schmidt-Cassegrain or Maksutov-Cassegrain telescopes.<br><br><strong>Alt-Azimuth (ALTAZM) Types:</strong><br>- <code>ALTAZM</code>: For Dobsonian telescopes and other alt-azimuth mounts. The controller continuously moves both axes (azimuth and altitude) for tracking.",
    "AXIS1_SPD_LABEL": "RA/AZM Axis Steps/Degree",
    "AXIS2_SPD_LABEL": "DEC/ALT Axis Steps/Degree",
    "AXIS_SPD_DESC": "<strong>This is the most important setting!</strong><br>It specifies how many microsteps the controller must send to the motor driver for the axis to rotate exactly one degree.<br><br><strong>Use the calculator!</strong><br>Enter the exact data for your mount, and the calculator will automatically fill in the correct value. The formula is: <code>(Motor Steps * Microsteps * Total Gear Ratio) / 360</code>",
    "AXIS_DM_LABEL": "Driver Model",
    "AXIS_DM_DESC": "Select the type of stepper motor driver IC. Choosing the correct model is critical as it determines how microstepping is set and the availability of special features (e.g., silent mode).<br><br><strong>Common Types:</strong><br>- <code>A4988</code> / <code>DRV8825</code>: Basic, reliable, but louder drivers.<br>- <code>TMC2209</code>: Modern, extremely quiet driver (StealthChop™ technology), recommended for most new builds.",
    "AXIS_MS_LABEL": "Microsteps (Tracking)",
    "AXIS_MS_DESC": "The driver divides one full step of the motor into this many smaller, intermediate steps (microsteps). A higher value results in smoother, resonance-free motion during tracking.<br><br><strong>Recommendation:</strong><br>- <code>A4988</code>/<code>DRV8825</code>: Usually 16 or 32.<br>- <code>TMCxxxx</code>: Usually 32 or 64. A very high value (128+) does not necessarily improve accuracy and can put more load on the controller.",
    "AXIS_MSG_LABEL": "Microsteps (GOTO)",
    "AXIS_MSG_DESC": "During a GOTO (fast positioning), the controller can switch to a lower microstep setting to achieve higher speed and torque.<br><br><strong>Recommendation:</strong><br>Typically 4 or 8. This allows the motors to reach their maximum speed without losing steps.",
    "AXIS_REV_LABEL": "Reverse Direction",
    "AXIS_REV_DESC": "If an axis moves in the opposite direction of what is expected, you can use this switch to reverse the motor's direction in software. An alternative is to swap the two wires of one coil of the 4 wires going to the motor.",
    "CALC_MOTOR_STEPS_LABEL": "Motor Steps",
    "CALC_MICROSTEPS_LABEL": "Microsteps",
    "microstepSetInStep3": "set in Step 3",
    "CALC_BELT_MOTOR_LABEL": "Motor Pulley",
    "CALC_BELT_WORM_LABEL": "Worm Pulley",
    "CALC_WORM_TEETH_LABEL": "Worm Wheel Teeth",
    "beltCalcButton": "Calculate Belt Length",
    "beltCalcTitle": "Belt Length Calculator",
    "beltCalcType": "Belt Type",
    "beltCalcP1": "Pulley 1 Teeth",
    "beltCalcP2": "Pulley 2 Teeth",
    "beltCalcPitch": "Belt Pitch (mm)",
    "beltCalcDist": "Axle Distance (mm)",
    "beltCalcResult": "Result",
    "beltCalcLength": "Required Belt Length",
    "beltCalcTeeth": "Nearest Tooth Count",
    "beltCalcPreset": "Preset Ratio",
    "beltCalcCustom": "Custom Calculation",
    "wiki_page_prerequisites_title": "Prerequisites",
    "wiki_page_prerequisites_content": "<p>Before you start building your OnStep, it's important to be aware of some basic requirements and necessary tools.</p><ul><li><b>Basic electronics knowledge:</b> You should know how to solder, understand the difference between voltage (V) and current (A), and how to safely work with low-voltage (12V) circuits.</li><li><b>Basic mechanical skills:</b> You should understand how gears and pulleys work and the concept of basic mechanical reduction.</li><li><b>Computer skills:</b> You must be able to install software (Arduino IDE, PlatformIO), manage drivers, and edit text-based configuration files.</li><li><b>Patience and perseverance:</b> OnStep is a DIY project. There will be challenges, and you will need to spend time troubleshooting. The community forums (Groups.io) are a great help!</li></ul>",
    "wiki_page_hardware_title": "Hardware Selection",
    "wiki_page_hardware_content": "<h2>Controller (MCU)</h2><p>The controller is the \"brain\" of OnStep. There are two main categories:</p><ul><li><b>8-bit (OnStep Classic):</b> Typically an <b>Arduino Mega 2560</b>. Reliable and cheap, but has limited performance. Perfect for getting started or for simpler mounts.</li><li><b>32-bit (OnStepX):</b> Typically <b>ESP32</b> or <b>STM32</b> based boards (e.g., FYSETC E4, MKS Gen L). Much higher processing power, enabling advanced features (WiFi, web interface, more complex pointing models). These are the recommended controllers today.</li></ul><h2>Motor Drivers</h2><p>These circuits connect between the controller and the stepper motors. They convert the signals from the controller into the power needed to move the motors.</p><ul><li><b>Silent Drivers:</b> The <code>TMC2209</code> is the most popular choice. They provide extremely quiet operation (StealthChop™ mode), which is pleasant for both astrophotography and visual observing.</li><li><b>Traditional Drivers:</b> <code>DRV8825</code> or <code>A4988</code>. They are cheaper but louder. They work perfectly fine, but the noise can be distracting.</li></ul><h2>Stepper Motors</h2><p><code>NEMA 17</code> size stepper motors are the most common. The most important parameters are steps per revolution (typically 200 or 400) and torque. For an average mount, motors with around 40 N·cm of torque are usually sufficient.</p>",
    "wiki_page_gearing_title": "Understanding Gearing",
    "wiki_page_gearing_content": "<h2>Why is it necessary?</h2><p>Stepper motors on their own turn too fast and have too little torque to move a heavy telescope smoothly and precisely. Gearing reduces the speed and multiplies the torque.</p><h2>Types</h2><ul><li><b>Worm Gear Drive:</b> This is the most common in astronomical mounts. A single worm drives a large gear. The gear ratio is determined by the number of teeth on the gear (e.g., a 144-tooth wheel means a 144:1 ratio).</li><li><b>Belt and Pulley Drive:</b> Often used between the motor and the worm drive. The gear ratio is the ratio of the teeth on the two pulleys. For example, if the motor has a 16-tooth pulley and it drives a 48-tooth pulley on the worm, the ratio is 48/16 = 3:1.</li></ul><h2>Calculating `STEPS_PER_DEGREE`</h2><p>This is the most important parameter in the configuration. It specifies how many signals (microsteps) the controller must output to move the telescope one degree across the sky.<br>The formula is: <code>(Motor Steps * Microsteps * Total Gear Ratio) / 360</code><br><br><b>Example:</b><ul><li>Motor: 200 steps/revolution</li><li>Driver: 16 microsteps</li><li>Belt Drive: 16-tooth on motor, 48-tooth on worm (3:1)</li><li>Worm Drive: 144-tooth wheel (144:1)</li><li>Total Gear Ratio: 3 * 144 = 432:1</li></ul><code>(200 * 16 * 432) / 360 = 3840</code><br>In this case, the value for <code>AXIS1_STEPS_PER_DEGREE</code> would be 3840."
}
