
{
    "appTitle": "Configurador OnStep",
    "appDescription": "¡Bienvenido! Esta herramienta le ayuda a crear un archivo de configuración personalizado para su controlador de telescopio OnStep. Por favor, seleccione una versión de firmware para comenzar.",
    "classicTitle": "OnStep Classic",
    "onstepxTitle": "OnStepX",
    "classicTagline": "La opción estable para controladores de 8 bits.",
    "onstepxTagline": "El firmware moderno y rico en funciones para controladores de 32 bits.",
    "classicFeatures": "<li><b>Hardware de destino:</b> Microcontroladores de 8 bits (p. ej., Arduino Mega 2560).</li><li><b>Rendimiento:</b> Fiable pero con potencia de procesamiento limitada.</li><li><b>Funciones:</b> Incluye todas las funciones esenciales para el seguimiento astronómico básico y GOTO.</li><li><b>Ideal para:</b> Hardware más simple y antiguo, o cuando la máxima estabilidad es el objetivo.</li>",
    "onstepxFeatures": "<li><b>Hardware de destino:</b> Microcontroladores de 32 bits (p. ej., ESP32, STM32).</li><li><b>Rendimiento:</b> Significativamente más rápido y con más memoria.</li><li><b>Funciones:</b> Modelos de apuntado avanzados, WiFi, Bluetooth, interfaz web y muchas otras capacidades adicionales.</li><li><b>Ideal para:</b> Hardware moderno, si desea las últimas funciones y la máxima precisión.</li>",
    "wikiButton": "Wiki / Ayuda",
    "backToHomeButton": "‹ Volver al Menú Principal",
    "wizardTitleStep1": "Ajustes Básicos",
    "wizardTitleStep2": "Motor y Engranajes",
    "wizardTitleStep3": "Ajustes del Driver",
    "wizardTitleStep4": "Resumen y Generación",
    "wizardPrev": "Atrás",
    "wizardNext": "Siguiente",
    "wizardSummary": "Resumen",
    "summaryText": "Basado en sus ajustes, a continuación se muestra la vista previa del archivo <code>Config.h</code> generado. Si todo parece correcto, puede guardar el archivo con el botón 'Descargar'.",
    "summaryWaiting": "Generando configuración...",
    "downloadButton": "Descargar (Config.h)",
    "wikiTitle": "Base de Conocimientos",
    "wikiNavPrerequisites": "Prerrequisitos",
    "wikiNavHardware": "Selección de Hardware",
    "wikiNavGearing": "Engranajes",
    "PINMAP_LABEL": "Placa Controladora",
    "PINMAP_DESC": "<strong>¿Qué es esto?</strong><br>El PINMAP define qué pin del microcontrolador es responsable de qué función (p. ej., qué pin controla la señal 'step' del motor paso a paso de AR).<br><br><strong>¿Por qué es importante?</strong><br>Cada placa controladora de OnStep (p. ej., FYSETC E4, MaxPCB3) tiene una distribución de pines diferente. Seleccionar el PINMAP correcto es esencial, de lo contrario, el controlador no podrá mover los motores. Esta configuración selecciona el archivo <code>Pins.xxx.h</code> apropiado durante la compilación. ¡Consulte la documentación de su placa para obtener el valor correcto!",
    "MOUNT_TYPE_LABEL": "Tipo de Montura",
    "MOUNT_TYPE_DESC": "Especifique la construcción física de su montura de telescopio. Esto afecta fundamentalmente a cómo el controlador calcula el seguimiento de los objetos celestes.<br><br><strong>Tipos Ecuatoriales Alemanes (GEM):</strong><br>- <code>GEM</code>: Montura ecuatorial alemana estándar. La mayoría de las monturas ecuatoriales entran en esta categoría. OnStep maneja automáticamente los cambios de meridiano.<br>- <code>GEM_TA</code>, <code>GEM_TAC</code>: Para monturas GEM con un accionamiento de declinación de brazo tangente.<br><br><strong>Tipos de Horquilla (FORK):</strong><br>- <code>FORK</code>: Montura ecuatorial de horquilla estándar. Se utiliza normalmente con telescopios Schmidt-Cassegrain o Maksutov-Cassegrain.<br><br><strong>Tipos Alt-Azimut (ALTAZM):</strong><br>- <code>ALTAZM</code>: Para telescopios Dobson y otras monturas altazimutales. El controlador mueve continuamente ambos ejes (azimut y altitud) para el seguimiento.",
    "AXIS1_SPD_LABEL": "Pasos/Grado Eje AR/AZM",
    "AXIS2_SPD_LABEL": "Pasos/Grado Eje DEC/ALT",
    "AXIS_SPD_DESC": "<strong>¡Esta es la configuración más importante!</strong><br>Especifica cuántos micropasos debe enviar el controlador al driver del motor para que el eje gire exactamente un grado.<br><br><strong>¡Use la calculadora!</strong><br>Introduzca los datos exactos de su montura y la calculadora rellenará automáticamente el valor correcto. La fórmula es: <code>(Pasos del Motor * Micropasos * Relación de Engranajes Total) / 360</code>",
    "AXIS_DM_LABEL": "Modelo del Driver",
    "AXIS_DM_DESC": "Seleccione el tipo de CI del driver del motor paso a paso. Elegir el modelo correcto es fundamental, ya que determina cómo se configuran los micropasos y la disponibilidad de funciones especiales (p. ej., modo silencioso).<br><br><strong>Tipos Comunes:</strong><br>- <code>A4988</code> / <code>DRV8825</code>: Drivers básicos, fiables, pero más ruidosos.<br>- <code>TMC2209</code>: Driver moderno y extremadamente silencioso (tecnología StealthChop™), recomendado para la mayoría de las construcciones nuevas.",
    "AXIS_MS_LABEL": "Micropasos (Seguimiento)",
    "AXIS_MS_DESC": "El driver divide un paso completo del motor en esta cantidad de pasos intermedios más pequeños (micropasos). Un valor más alto resulta en un movimiento más suave y sin resonancias durante el seguimiento.<br><br><strong>Recomendación:</strong><br>- <code>A4988</code>/<code>DRV8825</code>: Generalmente 16 o 32.<br>- <code>TMCxxxx</code>: Generalmente 32 o 64. Un valor muy alto (128+) no mejora necesariamente la precisión y puede sobrecargar el controlador.",
    "AXIS_MSG_LABEL": "Micropasos (GOTO)",
    "AXIS_MSG_DESC": "Durante un GOTO (posicionamiento rápido), el controlador puede cambiar a una configuración de micropasos más baja para lograr mayor velocidad y par.<br><br><strong>Recomendación:</strong><br>Típicamente 4 u 8. Esto permite que los motores alcancen su velocidad máxima sin perder pasos.",
    "AXIS_REV_LABEL": "Invertir Dirección",
    "AXIS_REV_DESC": "Si un eje se mueve en la dirección opuesta a la esperada, puede usar este interruptor para invertir la dirección del motor por software. Una alternativa es intercambiar los dos cables de una de las bobinas de los 4 cables que van al motor.",
    "CALC_MOTOR_STEPS_LABEL": "Pasos del Motor",
    "CALC_MICROSTEPS_LABEL": "Micropasos",
    "microstepSetInStep3": "definido en el Paso 3",
    "CALC_BELT_MOTOR_LABEL": "Polea del Motor",
    "CALC_BELT_WORM_LABEL": "Polea del Sin Fin",
    "CALC_WORM_TEETH_LABEL": "Dientes Rueda Corona",
    "beltCalcButton": "Calcular Longitud de Correa",
    "beltCalcTitle": "Calculadora de Longitud de Correa",
    "beltCalcType": "Tipo de Correa",
    "beltCalcP1": "Dientes Polea 1",
    "beltCalcP2": "Dientes Polea 2",
    "beltCalcPitch": "Paso de la Correa (mm)",
    "beltCalcDist": "Distancia entre Ejes (mm)",
    "beltCalcResult": "Resultado",
    "beltCalcLength": "Longitud de Correa Requerida",
    "beltCalcTeeth": "Número de Dientes más Cercano",
    "beltCalcPreset": "Relación Predefinida",
    "beltCalcCustom": "Cálculo Personalizado"
}
