
{
    "appTitle": "OnStep Konfigurátor",
    "appDescription": "Üdvözlünk! Ez az eszköz segít létrehozni a személyre szabott konfigurációs fájlt az OnStep távcsővezérlődhöz. Kérlek, válassz firmware verziót a kezdéshez.",
    "classicTitle": "OnStep Classic",
    "onstepxTitle": "OnStepX",
    "classicTagline": "A stabil választás 8-bites vezérlőkhöz.",
    "onstepxTagline": "A modern, funkciókban gazdag firmware 32-bites vezérlőkhöz.",
    "classicFeatures": "<li><b>Célhardver:</b> 8-bites mikrokontrollerek (pl. Arduino Mega 2560).</li><li><b>Teljesítmény:</b> Megbízható, de korlátozottabb számítási kapacitás.</li><li><b>Funkciók:</b> Az alapvető csillagászati követéshez és GOTO-hoz szükséges összes funkciót tartalmazza.</li><li><b>Ideális:</b> Egyszerűbb, régebbi hardverekhez, vagy ha a maximális stabilitás a cél.</li>",
    "onstepxFeatures": "<li><b>Célhardver:</b> 32-bites mikrokontrollerek (pl. ESP32, STM32).</li><li><b>Teljesítmény:</b> Jelentősen gyorsabb és több memóriával rendelkezik.</li><li><b>Funkciók:</b> Fejlett pointing modellek, WiFi, Bluetooth, webes felület és sok más extra képesség.</li><li><b>Ideális:</b> Modern hardverekhez, ha a legújabb funkciókat és a legnagyobb pontosságot szeretnéd elérni.</li>",
    "wikiButton": "Wiki / Súgó",
    "backToHomeButton": "‹ Vissza a főmenübe",
    "wizardTitleStep1": "Alapbeállítások",
    "wizardTitleStep2": "Motor és Áttétel",
    "wizardTitleStep3": "Meghajtó Beállítások",
    "wizardTitleStep4": "Összegzés és Generálás",
    "wizardPrev": "Vissza",
    "wizardNext": "Tovább",
    "wizardSummary": "Összegzés",
    "summaryText": "A beállításaid alapján a generált <code>Config.h</code> fájl előnézete alább látható. Ha minden rendben, a 'Letöltés' gombbal mentheted a fájlt.",
    "summaryWaiting": "A konfiguráció generálása...",
    "downloadButton": "Letöltés (Config.h)",
    "wikiTitle": "Tudásbázis",
    "wikiNavPrerequisites": "Előfeltételek",
    "wikiNavHardware": "Hardver választás",
    "wikiNavGearing": "Áttételek",
    "PINMAP_LABEL": "Vezérlőpanel (PINMAP)",
    "PINMAP_DESC": "<strong>Mi ez?</strong><br>A PINMAP határozza meg, hogy a mikrokontroller melyik lába melyik funkcióért felelős (pl. melyik láb vezérli a RA léptetőmotor 'step' jelét).<br><br><strong>Miért fontos?</strong><br>Minden OnStep vezérlőpanel (pl. FYSETC E4, MaxPCB3) más és más lábkiosztással rendelkezik. A helyes PINMAP kiválasztása elengedhetetlen, különben a vezérlő nem fogja tudni mozgatni a motorokat. Ez a beállítás választja ki a megfelelő <code>Pins.xxx.h</code> fájlt a fordításkor. Ellenőrizd a választott panel dokumentációját a helyes értékért!",
    "MOUNT_TYPE_LABEL": "Mechanika Típusa (MOUNT_TYPE)",
    "MOUNT_TYPE_DESC": "Add meg a távcső mechanikájának fizikai felépítését. Ez alapvetően befolyásolja, hogyan számolja a vezérlő az égi objektumok követését.<br><br><strong>Német Ekvatoriális (GEM) Típusok:</strong><br>- <code>GEM</code>: Standard német ekvatoriális mechanika. A legtöbb ekvatoriális mechanika ebbe a kategóriába tartozik. Az OnStep automatikusan kezeli a meridiánon való átfordulást (meridian flip).<br>- <code>GEM_TA</code>, <code>GEM_TAC</code>: Tangenskaros deklinációs meghajtással rendelkező GEM mechanikákhoz.<br><br><strong>Villás (FORK) Típusok:</strong><br>- <code>FORK</code>: Standard villás ekvatoriális mechanika. Jellemzően Schmidt-Cassegrain vagy Maksutov-Cassegrain távcsöveknél használatos.<br><br><strong>Alt-Azimut (ALTAZM) Típusok:</strong><br>- <code>ALTAZM</code>: Dobson-távcsövekhez és más alt-azimut állványokhoz. A vezérlő mindkét tengelyt (azimut és magasság) folyamatosan mozgatja a követéshez.",
    "AXIS1_SPD_LABEL": "RA/AZM Tengely Lépés/Fok (STEPS_PER_DEGREE)",
    "AXIS2_SPD_LABEL": "DEC/ALT Tengely Lépés/Fok (STEPS_PER_DEGREE)",
    "AXIS_SPD_DESC": "<strong>Ez a legfontosabb beállítás!</strong><br>Azt adja meg, hogy a vezérlőnek hány mikrolépést kell kiadnia a motor meghajtónak ahhoz, hogy a tengely pontosan egy fokot elforduljon.<br><br><strong>Használd a kalkulátort!</strong><br>Add meg a mechanikád pontos adatait és a kalkulátor automatikusan kitölti a helyes értéket. A képlet: <code>(Motor Lépés * Mikrolépés * Teljes Áttétel) / 360</code>",
    "AXIS_DM_LABEL": "Meghajtó Modell",
    "AXIS_DM_DESC": "Válaszd ki a léptetőmotor meghajtó IC típusát. A helyes modell kiválasztása kritikus, mert ez határozza meg a mikrolépések beállításának módját és a speciális funkciók (pl. csendes mód) elérhetőségét.<br><br><strong>Gyakori Típusok:</strong><br>- <code>A4988</code> / <code>DRV8825</code>: Alap, megbízható, de hangosabb meghajtók.<br>- <code>TMC2209</code>: Modern, rendkívül halk meghajtó (StealthChop™ technológia), a legtöbb új építéshez ez ajánlott.",
    "AXIS_MS_LABEL": "Mikrolépés (Követés)",
    "AXIS_MS_DESC": "A motor egy teljes lépését ennyi kisebb, köztes lépésre (mikrolépésre) bontja a meghajtó. A magasabb érték simább, rezonanciamentesebb mozgást eredményez követés közben.<br><br><strong>Ajánlás:</strong><br>- <code>A4988</code>/<code>DRV8825</code>: Általában 16 vagy 32.<br>- <code>TMCxxxx</code>: Általában 32 vagy 64. A túl magas érték (128+) már nem feltétlenül javítja a pontosságot, és jobban terhelheti a vezérlőt.",
    "AXIS_MSG_LABEL": "Mikrolépés (GOTO)",
    "AXIS_MSG_DESC": "GOTO (gyors pozicionálás) közben a vezérlő alacsonyabb mikrolépés beállításra válthat a nagyobb sebesség és nyomaték elérése érdekében.<br><br><strong>Ajánlás:</strong><br>Jellemzően 4 vagy 8. Ez lehetővé teszi, hogy a motorok elérjék a maximális sebességüket anélkül, hogy lépést vesztenének.",
    "AXIS_REV_LABEL": "Forgásirány Megfordítása",
    "AXIS_REV_DESC": "Ha a tengely a vártal ellenkező irányba mozog, ezzel a kapcsolóval megfordíthatod a motor forgásirányát szoftveresen. Alternatív megoldás a motorra menő 4 vezeték közül az egyik tekercs két vezetékének a felcserélése.",
    "CALC_MOTOR_STEPS_LABEL": "Motor Lépés",
    "CALC_MOTOR_STEPS_DESC": "A léptetőmotor egy teljes, 360 fokos körbefordulásához szükséges lépések száma. A leggyakoribb érték a 200 (1.8°/lépés), de léteznek 400 lépéses (0.9°/lépés) motorok is.",
    "CALC_MICROSTEPS_LABEL": "Mikrolépés",
    "CALC_MICROSTEPS_DESC": "A motor egy teljes lépését ennyi kisebb, köztes lépésre (mikrolépésre) bontja a meghajtó. Ezt az értéket a 'Meghajtó Beállítások' lépésben állítod be a követési (tracking) sebességhez.",
    "microstepSetInStep3": "a 3. lépésben beállítva",
    "CALC_BELT_MOTOR_LABEL": "Motor Szíjtárcsa",
    "CALC_BELT_MOTOR_DESC": "Ha van szíjhajtás a motor és a csiga között, itt add meg a motor tengelyén lévő szíjtárcsa fogainak számát. Ha nincs szíjhajtás, hagyd az értéket 1-en.",
    "CALC_BELT_WORM_LABEL": "Csiga Szíjtárcsa",
    "CALC_BELT_WORM_DESC": "Ha van szíjhajtás a motor és a csiga között, itt add meg a csiga tengelyén lévő szíjtárcsa fogainak számát. Ha nincs szíjhajtás, hagyd az értéket 1-en.",
    "CALC_WORM_TEETH_LABEL": "Csigakerék Fogszám",
    "CALC_WORM_TEETH_DESC": "A mechanika fő áttételét adó csigakerék fogainak száma. Ez egy kritikus adat, nézd meg a mechanikád dokumentációjában. Pl. EQ5/HEQ5: 144, EQ6: 180.",
    "beltCalcButton": "Szíjhossz számítása",
    "beltCalcTitle": "Szíjhossz Kalkulátor",
    "beltCalcP1": "1. tárcsa fogszám",
    "beltCalcP2": "2. tárcsa fogszám",
    "beltCalcPitch": "Szíj osztás (mm)",
    "beltCalcDist": "Tengelytáv (mm)",
    "beltCalcResult": "Eredmény",
    "beltCalcLength": "Szükséges szíjhossz",
    "beltCalcTeeth": "Legközelebbi fogszám",
    "beltCalcPreset": "Előre beállított áttétel",
    "beltCalcCustom": "Egyéni számítás",
    "wiki_page_prerequisites_title": "Előfeltételek",
    "wiki_page_prerequisites_content": "<p>Mielőtt belevágnál az OnStep építésébe, fontos tisztában lenni néhány alapvető feltétellel és szükséges eszközzel.</p><ul><li><b>Alapvető elektronikai ismeretek:</b> Tudnod kell, hogyan kell forrasztani, mi a különbség a feszültség (V) és az áramerősség (A) között, és hogyan kell biztonságosan dolgozni alacsony feszültségű (12V) áramkörökkel.</li><li><b>Mechanikai alapismeretek:</b> Értened kell a fogaskerekek, szíjtárcsák működését és az alapvető mechanikai áttételek fogalmát.</li><li><b>Számítógépes ismeretek:</b> Képesnek kell lenned szoftvereket telepíteni (Arduino IDE, PlatformIO), drivereket kezelni és szöveges konfigurációs fájlokat szerkeszteni.</li><li><b>Türelem és kitartás:</b> Az OnStep egy DIY (Csináld magad!) projekt. Lesznek kihívások, és időt kell szánnod a hibakeresésre. A közösségi fórumok (Groups.io) nagy segítséget nyújtanak!</li></ul>",
    "wiki_page_hardware_title": "Hardver választás",
    "wiki_page_hardware_content": "<h2>Vezérlő (MCU)</h2><p>A vezérlő az OnStep \"agya\". Két fő kategória létezik:</p><ul><li><b>8-bit (OnStep Classic):</b> Jellemzően <b>Arduino Mega 2560</b>. Megbízható, olcsó, de korlátozottabb a teljesítménye. Tökéletes kezdésnek vagy egyszerűbb mechanikákhoz.</li><li><b>32-bit (OnStepX):</b> Jellemzően <b>ESP32</b> vagy <b>STM32</b> alapú panelek (pl. FYSETC E4, MKS Gen L). Sokkal nagyobb számítási kapacitás, ami lehetővé teszi a fejlettebb funkciókat (WiFi, webes felület, komplexebb pointing modellek). Ma már ezek az ajánlott vezérlők.</li></ul><h2>Motor Meghajtók (Driverek)</h2><p>Ezek az áramkörök kapcsolódnak a vezérlő és a léptetőmotorok közé. A vezérlő által küldött jeleket alakítják át a motorok mozgatásához szükséges energiává.</p><ul><li><b>Csendes meghajtók:</b> A <code>TMC2209</code> a legnépszerűbb választás. Rendkívül halk működést biztosítanak (StealthChop™ mód), ami asztrofotózásnál és vizuális észlelésnél is kellemes.</li><li><b>Hagyományos meghajtók:</b> <code>DRV8825</code> vagy <code>A4988</code>. Olcsóbbak, de hangosabbak. Teljesen jól működnek, de a zaj zavaró lehet.</li></ul><h2>Léptetőmotorok</h2><p>A <code>NEMA 17</code> méretű léptetőmotorok a legelterjedtebbek. A legfontosabb paraméter a lépés/fordulat (jellemzően 200 vagy 400) és a nyomaték. Egy átlagos mechanikához 40 N·cm körüli nyomatékú motorok általában elegendőek.</p>",
    "wiki_page_gearing_title": "Áttételek Megértése",
    "wiki_page_gearing_content": "<h2>Miért van rá szükség?</h2><p>A léptetőmotorok önmagukban túl gyorsan forognak és túl gyenge a nyomatékuk ahhoz, hogy egy nehéz távcsövet finoman és pontosan mozgassanak. Az áttételek lecsökkentik a sebességet és megsokszorozzák a nyomatékot.</p><h2>Típusok</h2><ul><li><b>Csigás meghajtás (Worm Gear):</b> Ez a leggyakoribb a csillagászati mechanikákban. Egyetlen csiga hajt egy nagy fogaskereket. Az áttételi arányt a fogaskerék fogainak száma adja meg (pl. egy 144 fogú kerék 144:1 áttételt jelent).</li><li><b>Szíjhajtás (Belt and Pulley):</b> Gyakran használják a motor és a csigás meghajtás között. Az áttételi arányt a két szíjtárcsa fogainak aránya adja meg. Például, ha a motoron egy 16 fogú tárcsa van, és a csigát egy 48 fogú tárcsa hajtja, az áttétel 48/16 = 3:1.</li></ul><h2>A `STEPS_PER_DEGREE` Kiszámítása</h2><p>Ez a legfontosabb paraméter a konfigurációban. Azt adja meg, hogy a vezérlőnek hány jelet (mikrolépést) kell kiadnia ahhoz, hogy a távcső egy fokot elmozduljon az égen.<br>A képlete: <code>(Motor lépés * Mikrolépés * Teljes áttétel) / 360</code><br><br><b>Példa:</b><ul><li>Motor: 200 lépés/fordulat</li><li>Meghajtó: 16 mikrolépés</li><li>Szíjhajtás: 16 fogú motoron, 48 fogú a csigán (3:1)</li><li>Csigás hajtás: 144 fogú kerék (144:1)</li><li>Teljes áttétel: 3 * 144 = 432:1</li></ul><code>(200 * 16 * 432) / 360 = 3840</code><br>Ebben az esetben a <code>AXIS1_STEPS_PER_DEGREE</code> értéke 3840 lenne."
}
